<?php

return [
    'title' => 'Мы используем файлы cookie',
    'intro' => 'Этот веб-сайт использует файлы cookie для улучшения пользовательского опыта.',
    'link' => 'Ознакомьтесь с нашей <a href=":url">Политикой использования cookie</a> для получения дополнительной информации.',

    'essentials' => 'Только необходимые',
    'all' => 'Принять все',
    'customize' => 'Настроить',
    'manage' => 'Управление файлами cookie',
    'details' => [
        'more' => 'Подробнее',
        'less' => 'Скрыть детали',
    ],
    'save' => 'Сохранить настройки',
    'cookie' => 'Cookie',
    'purpose' => 'Назначение',
    'duration' => 'Срок действия',
    'year' => 'Год|Года|Лет',
    'day' => 'День|Дня|Дней',
    'hour' => 'Час|Часа|Часов',
    'minute' => 'Минута|Минуты|Минут',

    'categories' => [
        'essentials' => [
            'title' => 'Необходимые файлы cookie',
            'description' => 'Некоторые файлы cookie необходимы для работы сайта. Они не требуют вашего согласия.',
        ],
        'analytics' => [
            'title' => 'Аналитические файлы cookie',
            'description' => 'Мы используем их для внутреннего анализа того, как можно улучшить наш сервис. Они оценивают, как вы взаимодействуете с сайтом.',
        ],
        'optional' => [
            'title' => 'Дополнительные файлы cookie',
            'description' => 'Эти файлы cookie активируют функции, которые могут улучшить ваш опыт, но их отсутствие не повлияет на возможность пользоваться сайтом.',
        ],
    ],

    'defaults' => [
        'consent' => 'Используется для хранения предпочтений пользователя в отношении файлов cookie.',
        'session' => 'Используется для идентификации сессии пользователя.',
        'csrf' => 'Используется для защиты пользователя и сайта от атак типа "межсайтовая подделка запроса".',
        '_ga' => 'Основной файл cookie Google Analytics, позволяет отличать одного посетителя от другого.',
        '_ga_ID' => 'Используется Google Analytics для сохранения состояния сеанса.',
        '_gid' => 'Используется Google Analytics для идентификации пользователя.',
        '_gat' => 'Используется Google Analytics для ограничения частоты запросов.',
    ],
];
