<?php

return [
    'title' => 'Ми використовуємо файли cookie',
    'intro' => 'Цей веб-сайт використовує файли cookie для покращення користувацького досвіду.',
    'link' => 'Перегляньте нашу <a href=":url">Політику використання cookie</a> для отримання додаткової інформації.',

    'essentials' => 'Тільки необхідні',
    'all' => 'Прийняти всі',
    'customize' => 'Налаштувати',
    'manage' => 'Керування файлами cookie',
    'details' => [
        'more' => 'Докладніше',
        'less' => 'Приховати деталі',
    ],
    'save' => 'Зберегти налаштування',
    'cookie' => 'Cookie',
    'purpose' => 'Призначення',
    'duration' => 'Термін дії',
    'year' => 'Рік|Роки|Років',
    'day' => 'День|Дні|Днів',
    'hour' => 'Година|Години|Годин',
    'minute' => 'Хвилина|Хвилини|Хвилин',

    'categories' => [
        'essentials' => [
            'title' => 'Необхідні файли cookie',
            'description' => 'Деякі файли cookie необхідні для роботи сайту. Вони не потребують вашої згоди.',
        ],
        'analytics' => [
            'title' => 'Аналітичні файли cookie',
            'description' => 'Ми використовуємо їх для внутрішнього аналізу того, як можна покращити наш сервіс. Вони оцінюють, як ви взаємодієте із сайтом.',
        ],
        'optional' => [
            'title' => 'Додаткові файли cookie',
            'description' => 'Ці файли cookie активують функції, які можуть покращити ваш досвід, але їх відсутність не вплине на можливість користуватися сайтом.',
        ],
    ],

    'defaults' => [
        'consent' => 'Використовується для збереження налаштувань користувача щодо файлів cookie.',
        'session' => 'Використовується для ідентифікації сесії користувача.',
        'csrf' => 'Використовується для захисту користувача та сайту від атак типу "міжсайтовий підроблений запит".',
        '_ga' => 'Основний файл cookie Google Analytics, дозволяє відрізняти одного відвідувача від іншого.',
        '_ga_ID' => 'Використовується Google Analytics для збереження стану сеансу.',
        '_gid' => 'Використовується Google Analytics для ідентифікації користувача.',
        '_gat' => 'Використовується Google Analytics для обмеження частоти запитів.',
    ],
];
